[
    { "name": "Defeat Araxxor and Araxxi while at most 10% of the total acid remains in the pool after taking the Acid path during phase 2. Hard" },
    { "name": "Defeat Barrows: Rise of the Six without anyone being hit by Verac's 'Deathcopter' attack. Hard" },
    { "name": "Defeat Araxxi. (X/25) Hard" },
    { "name": "Defeat the Ambassador. (X/10) Hard" },
    { "name": "Defeat Araxxi solo in less than 05:00. Hard" },
    { "name": "Beat Seiryu without anyone taking damage from the shadow tendrils. Hard" },
    { "name": "Defeat the Arch-Glacor solo with all mechanics enabled in less than 03:00. Hard" },
    { "name": "Defeat General Graardor in hard mode, solo, without being hit by damage reflected by his 'Graardor Protect' attack. Hard" },
    { "name": "Defeat Astellarn solo in less than 01:30. Hard" },
    { "name": "Defeat the Twin Furies solo without being hit by Avaryss' 'Surge' attack. Hard" },
    { "name": "Defeat Vermyx, Brood Mother without being hit by her 'Wyrmfire' attack. Hard" },
    { "name": "Defeat the empowered Barrows Brothers. (X/25) Hard" },
    { "name": "Defeat Barrows: Rise of the Six in a team of 4 or fewer in less than 01:00. Hard" },
    { "name": "Defeat the Kalphite King in a team of 4 or fewer without anyone dying to a 'Beetlejuice' attack. Hard" },
    { "name": "Defeat Astellarn the First Celestial. (X/10) Hard" },
    { "name": "Defeat General Graardor in hard mode, solo, without taking damage from his 'Graardor Smash' attack. Hard" },
    { "name": "Defeat Kree'arra in hard mode. (X/25) Hard" },
    { "name": "Defeat the Black Stone Dragon solo in less than 05:30. Hard" },
    { "name": "Defeat Gregorovic solo without being hit by his 'Glaives' attack. Hard" },
    { "name": "Defeat Verak Lith without being hit by their 'Black Dragon Dive Bomb' attack. Hard" },
    { "name": "Defeat Nex. (X/25) Hard" },
    { "name": "Defeat Verak Lith without anyone dispersing their damage into a pile of eggs. Hard" },
    { "name": "Defeat Rise of the Six on six different occasions, leaving a different brother to last. Hard" },
    { "name": "Defeat the Kalphite King. (X/25) Hard" },
    { "name": "Defeat the Twin Furies solo without dealing damage during their channelled bomb attack. Hard" },
    { "name": "Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his 'Burrow' attacks. Hard" },
    { "name": "Defeat Kezalam, the Wanderer without being hit by her 'Soul Bomb' attack. Hard" },
    { "name": "Defeat Kerapac, the bound without getting hit by his 'Lightning Strike' attack. Hard" },
    { "name": "Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his 'Charge' attacks. Hard" },
    { "name": "Defeat Vindicta & Gorvek solo whilst having equipped a shield that provides protection against dragonfire. Hard" },
    { "name": "Defeat Araxxor and Araxxi without anyone being hit by their 'Cleave' attack. Hard" },
    { "name": "Defeat Nex solo, without being hit by her 'Contain' and 'Ice Prison' attacks during her Ice phase. Hard" },
    { "name": "Defeat Commander Zilyana in hard mode, solo, in less than 01:15. Hard" },
    { "name": "Defeat Commander Zilyana solo in less than 00:30. Hard" },
    { "name": "Defeat the Twin Furies solo without being hit by their 'Explosion' attack. Hard" },
    { "name": "Defeat the Corporeal Beast solo in less than 00:30. Hard" },
    { "name": "Defeat the Sanctum Guardian. (X/10) Hard" },
    { "name": "Defeat the Sanctum Guardian with exactly 10 crassians still alive when she dies. Hard" },
    { "name": "Defeat Crassian Leviathan solo in less than 02:30. Hard" },
    { "name": "Defeat the Magister. (X/25) Hard" },
    { "name": "Defeat the Crassian Leviathan. (X/10) Hard" },
    { "name": "Defeat Taraket the Necromancer while the bloated monstrosity is still alive. Hard" },
    { "name": "Defeat Verak Lith after using the correct protection prayer against all of his 'Spire' attacks. Hard" },
    { "name": "Defeat Zemouregal & Vorkath without triggering the optional rituals. Hard" },
    { "name": "Defeat Verak Lith while ensuring every ricocheted attack is absorbed and dispersed into a pile of eggs. Hard" },
    { "name": "Defeat Araxxor and Araxxi while at least 40% (Duo: 80%) of the total acid remains in the pool after taking the Acid path during phase 2. Hard" },
    { "name": "Defeat Nakatra, Devourer Eternal. (X/10) Hard" },
    { "name": "Defeat the Rex Matriarchs, Pthentraken, Orikalka, and Rathis, all within 5 seconds of each other. Can only be completed in a solo instance. Hard" },
    { "name": "Defeat Masuta the Ascended without any stacks of the calm waters effect. Hard" },
    { "name": "Defeat all 4 black hands, within 10 seconds after defeating the first, during the Black Stone Dragon fight. Hard" },
    { "name": "Defeat Gregorovic solo without allowing him to absorb any spirits. Hard" },
    { "name": "Defeat General Graardor in hard mode. (X/25) Hard" },
    { "name": "Defeat General Graardor in hard mode, solo, in less than 00:45. Hard" },
    { "name": "Defeat General Graardor solo in less than 00:15. Hard" },
    { "name": "Defeat the Crassian Leviathan after taking at least 30,000 damage from its sweep attack. Hard" },
    { "name": "Defeat Corporeal Beast using only a bronze spear. Can only be completed in a solo instance. Hard" },
    { "name": "Defeat Gregorovic in hard mode. (X/25) Hard" },
    { "name": "Defeat Gregorovic in hard mode in less than 02:30. Hard" },
    { "name": "Defeat Gregorovic solo in less than 01:09. Hard" },
    { "name": "Defeat Barrows: Rise of the Six without anyone being hit by Torag's 'Whack' attack. Hard" },
    { "name": "Defeat the Black Stone Dragon without anyone being hit by her 'Grasping Hands' attack. Hard" },
    { "name": "Defeat the Har-Aken in less than 40:00. Hard" },
    { "name": "Defeat the Crassian Leviathan after allowing it to fully regenerate from below half health. Hard" },
    { "name": "Defeat the Har-Aken. (X/10) Hard" },
    { "name": "Defeat TzTok-Jad without killing any Yt-HurKot. Hard" },
    { "name": "Defeat Vermyx, Brood Mother without letting any Corrupted scarab healer reach her. Hard" },
    { "name": "Defeat Helwyr in hard mode. (X/25) Hard" },
    { "name": "Defeat Helwyr in hard mode in less than 02:30. Hard" },
    { "name": "Defeat Helwyr solo in less than 00:45. Hard" },
    { "name": "Defeat the Sanctum Guardian after being hit by her 'Water Spout' 10 times. Hard" },
    { "name": "Defeat the Sanctum Guardian without anyone being hit by her 'Water Spout' attack. Hard" },
    { "name": "Defeat Hermod, the Spirit of War solo in less than 00:45. Hard" },
    { "name": "Defeat the Black Stone Dragon without anyone being hit by her 'Gemstone Shards' attack. Hard" },
    { "name": "Defeat Seiryu without anyone being hit by his 'Grasping Hands' attack. Hard" },
    { "name": "Defeat the Magister after becoming 50% corrupted. Hard" },
    { "name": "Defeat each of the six Legiones consecutively without leaving the Ascension dungeon. Hard" },
    { "name": "Defeat Rasial, the First Necromancer without being hit by his 'Ghost Wall' attack. Hard" },
    { "name": "Defeat the Magister after hitting him with his 'Unstable Mixture' attack. Hard" },
    { "name": "Defeat Kerapac, the bound without using the 'Warp Time' action ability. Hard" },
    { "name": "Defeat Gregorovic solo without dealing any damage to his spirits. Hard" },
    { "name": "Defeat the Magister without being hit by his 'Unstable Mixture' attack. Hard" },
    { "name": "Defeat K'ril Tsutsaroth in hard mode, solo, in less than 00:45. Hard" },
    { "name": "Defeat K'ril Tsutsaroth solo in less than 00:24. Hard" },
    { "name": "Defeat the Kalphite King in a team of 2 or fewer in less than 01:00. Hard" },
    { "name": "Defeat Kerapac, the bound solo in less than 03:00. Hard" },
    { "name": "Defeat Kezalam, the Wanderer in less than 04:30. Hard" },
    { "name": "Defeat K'ril Tsutsaroth in hard mode. (X/25) Hard" },
    { "name": "Defeat Kree'arra in hard mode, solo, in less than 01:00. Hard" },
    { "name": "Defeat Kree'arra solo in less than 00:36. Hard" },
    { "name": "Defeat any of the six Ascension Legiones solo in less than 00:18. Hard" },
    { "name": "Defeat Araxxor and Araxxi without anyone standing in the light after taking the Darkness path during phase 2. Hard" },
    { "name": "Defeat any of the six Legiones solo without being hit by their 'Lightning' attack. Hard" },
    { "name": "Defeat Commander Zilyana in hard mode, solo, without being hit by her 'Lightning' attack. Hard" },
    { "name": "Defeat Barrows: Rise of the Six without anyone being hit by Karil's 'Portal Explosion' attack. Hard" },
    { "name": "Defeat 18 shadow enigmas in 6 seconds. Hard" },
    { "name": "Defeat Masuta the Ascended solo in less than 05:00. Hard" },
    { "name": "Defeat Masuta the Ascended. (X/10) Hard" },
    { "name": "Defeat Nex while accompanied by each of the nihil followers. Hard" },
    { "name": "Defeat Vermyx, Brood Mother without being hit by her 'Moonstone Shard' attack. Hard" },
    { "name": "Defeat Avaryss and Nymora in hard mode. (X/25) Hard" },
    { "name": "Defeat Nakatra, Devourer Eternal in less than 06:00. Hard" },
    { "name": "Get charged by the Kalphite King to each side of the arena and then defeat him. Hard" },
    { "name": "Defeat Nex solo in less than 03:00. Hard" },
    { "name": "Defeat Rasial, the First Necromancer. (X/25) Hard" },
    { "name": "Defeat the Black Stone Dragon without taking damage from any shadow flames. Hard" },
    { "name": "Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his orange 'Bomb' attacks. Hard" },
    { "name": "Defeat the Sanctum Guardian without anyone taking any damage from her purple corruption. Hard" },
    { "name": "Defeat Barrows: Rise of the Six without anyone being hit by Karil's 'Bombard' attack. Hard" },
    { "name": "Defeat the Queen Black Dragon in less than 01:30. Hard" },
    { "name": "Defeat Rasial, the First Necromancer in less than 02:30. Hard" },
    { "name": "Defeat Kerapac, the bound without being hit by his 'Jumping Slam' attack. Hard" },
    { "name": "Defeat Taraket the Necromancer. (X/10) Hard" },
    { "name": "Defeat the Sanctum Guardian solo in less than 02:15. Hard" },
    { "name": "Defeat Kezalam, the Wanderer without letting any Volatile scarab akh explode. Hard" },
    { "name": "Defeat Seiryu the Azure Serpent solo in less than 05:00. Hard" },
    { "name": "Defeat Nex solo, without being hit by her 'Shadow Smash' attack during her Shadow phase. Hard" },
    { "name": "Defeat Kerapac, the bound without letting him send a rift of time from his 'Shatter' attack. Hard" },
    { "name": "Defeat Taraket the Necromancer while the corpse carrier is still alive. Hard" },
    { "name": "Defeat Seiryu the Azure Serpent. (X/10) Hard" },
    { "name": "Defeat Vindicta & Gorvek solo after using the correct protection prayer against their ranged attacks. Hard" },
    { "name": "Defeat the Arch-Glacor with all mechanics enabled. Hard" },
    { "name": "Defeat the Arch-Glacor in hard mode. (X/25) Hard" },
    { "name": "Defeat Vermyx, Brood Mother without being hit by her 'Soul Bomb' attack. Hard" },
    { "name": "Defeat Vermyx, Brood Mother after redirecting all souls. Hard" },
    { "name": "Defeat Barrows: Rise of the Six without anyone being hit by a 'Hurricane' attack. Hard" },
    { "name": "Defeat Taraket the Necromancer without anyone defeating any of the 'Rifts of Undeath'. Hard" },
    { "name": "Defeat each of the six Legiones without moving. Hard" },
    { "name": "Defeat the Twin Furies solo without being hit by Nymora's 'Rain Death' attack. Hard" },
    { "name": "Defeat the Queen Black Dragon after cancelling the time stop attack. Hard" },
    { "name": "Defeat Masuta the Ascended with at least 7 thrashing waters still remaining. Hard" },
    { "name": "Defeat Commander Zilyana in hard mode, solo, whilst under the effects of her 'Lightning' attack and the Sunshine ability. Hard" },
    { "name": "Defeat Verak Lith. (X/10) Hard" },
    { "name": "Defeat Masuta the Ascended with 65% of the calm waters effect or more. Hard" },
    { "name": "Defeat Barrows: Rise of the Six without anyone being hit by Guthan's 'Impale' attack. Hard" },
    { "name": "Defeat Taraket the Necromancer solo in less than 04:00. Hard" },
    { "name": "Defeat the Har-Aken without defeating any of his tentacles. Hard" },
    { "name": "Defeat the Magister after cancelling his 'Soul Siphon' attack. Hard" },
    { "name": "Defeat the Ambassador solo in less than 06:00. Hard" },
    { "name": "Defeat Verak Lith without being hit by their 'Flame Vortex' attack. Hard" },
    { "name": "Defeat the Magister in less than 00:45. Hard" },
    { "name": "Defeat Vermyx, Brood Mother, while four of her coilspawn are still alive. Hard" },
    { "name": "Defeat Helwyr solo without being hit by his 'Thrash' attack. Hard" },
    { "name": "Defeat Kerapac. (X/25) Hard" },
    { "name": "Defeat Nex solo, without being moved by her 'Drag' attack during her Smoke phase. Hard" },
    { "name": "Defeat Nakatra, Devourer Eternal without being hit by her 'Soulfire' attack. Hard" },
    { "name": "Defeat Helwyr solo without being hit by his 'The Aid of Nature' attack. Hard" },
    { "name": "Defeat the Crassian Leviathan without anyone poisoning it. Hard" },
    { "name": "Defeat K'ril Tsutsaroth in hard mode, solo, without being hit by his 'Smash' attack. Hard" },
    { "name": "Defeat the Twin Furies solo in hard mode in less than 01:00. Hard" },
    { "name": "Defeat the Twin Furies solo in less than 00:48. Hard" },
    { "name": "Defeat Barrows: Rise of the Six without anyone being hit by Karil's 'Lightning Conductor' attack and Ahrim's 'Turret of Fire' attack. Hard" },
    { "name": "Defeat TzTok-Jad in less than 45:00. Hard" },
    { "name": "Kill 15 summoned skeletons within 6 seconds during the encounter with Taraket the Necromancer. Hard" },
    { "name": "Defeat Verak Lith solo in less than 04:00. Hard" },
    { "name": "Defeat Vermyx, Brood Mother in less than 03:30. Hard" },
    { "name": "Defeat Vindicta & Gorvek in hard mode in less than 03:30. Hard" },
    { "name": "Defeat Vindicta & Gorvek solo in less than 00:45. Hard" },
    { "name": "Defeat Vindicta and Gorvek in hard mode. (X/25) Hard" },
    { "name": "Defeat the Queen Black Dragon without being hit by her fire wave attack. Hard" },
    { "name": "Defeat K'ril Tsutsaroth in hard mode, solo, without being hit by his 'Charge' attack. Hard" },
    { "name": "Defeat Astellarn, with your entire group having taken less than 10,000 total damage from her solar storm throughout the fight. Hard" },
    { "name": "Defeat Kree'arra in hard mode, solo, without being hit by his 'Vortex' attack. Hard" },
    { "name": "Defeat Araxxi at 100% enrage. Hard" },
    { "name": "Defeat Araxxi after using the correct protection prayer against all of her basic attacks in phase 4. Hard" },
    { "name": "Defeat Araxxor and Araxxi without anyone taking unnecessary damage from their 'Cocoon' attack. Hard" },
    { "name": "Defeat the Black Stone Dragon. (X/10) Hard" },
    { "name": "Defeat Kezalam, the Wanderer. (X/10) Hard" },
    { "name": "Defeat Vermyx, Brood Mother. (X/10) Hard" },
    { "name": "Defeat Helwyr whilst there are 4 Cywir Alphas still alive. Can only be completed in a solo instance. Hard" },
    { "name": "Defeat General Graardor in hard mode, solo, without taking damage from his 'Graardor Mad' attack. Hard" },
    { "name": "Defeat Zemouregal & Vorkath. (X/25) Hard" },
    { "name": "Defeat Zemouregal & Vorkath in less than 05:30. Hard" },
    { "name": "Defeat Commander Zilyana in hard mode. (X/25) Hard" },
    { "name": "A Quest for Understanding: Defeat Astellarn while at least two pulsars are still active. Elite" },
    { "name": "A Song of Ice and Ire IV: Defeat the Arch-Glacor at 500% enrage. (X/500) Elite" },
    { "name": "All Natural: Defeat the Har-Aken without using any crystals within the fight. Elite" },
    { "name": "All Together Now: Defeat all four images of Yakamaru within ten seconds of one another. Elite" },
    { "name": "Animal Cruelty: Have Durzag deal the killing blow to both Tuz and Krar. Elite" },
    { "name": "Araxxi Elite Speed Killer: Defeat Araxxi solo in less than 03:00. Elite" },
    { "name": "Arch-Glacor (HM) Elite Speed Killer: Defeat the Arch-Glacor in hard mode at 500% or higher enrage in less than 05:00. Elite" },
    { "name": "Are You Winning, Zam? IV: Defeat Zamorak at 500% enrage in a solo encounter. Elite" },
    { "name": "Astellarn Elite Speed Killer: Defeat Astellarn solo in less than 01:00. Elite" },
    { "name": "Attack of the Clones III: Defeat Kerapac in hard mode. (X/25) Elite" },
    { "name": "Barrows: Rise of the Six (perfect): Defeat Barrows: Rise of the Six while completing the listed achievements. Elite" },
    { "name": "Barrows: Rise of the Six (solo): Defeat Barrows: Rise of the Six solo. Elite" },
    { "name": "Barrows: Rise of the Six Elite Speed Killer: Defeat Barrows: Rise of the Six in a team of 4 or fewer in less than 00:18. Elite" },
    { "name": "Beastmaster Durzag Elite Speed Killer: Defeat Beastmaster Durzag in less than 01:45. Elite" },
    { "name": "Best Offence: Defeat the Kalphite King after triggering his Immortality and then defeat him again. Elite" },
    { "name": "Better Not Touch: Defeat Yakamaru with all but one member of the raid still poisoned. Elite" },
    { "name": "Black Stone Dragon Elite Speed Killer: Defeat the Black Stone Dragon solo in less than 04:00. Elite" },
    { "name": "Bleed Tank: Defeat Vorago with only one person ever being the target of the 'Destroy Tank' attack during the 'Vitalis Bomb' stage. Elite" },
    { "name": "Blessing Denied: Defeat Solak, Guardian of the Grove without anyone using the 'Nature's Blessing' action ability. Elite" },
    { "name": "Bouncing Around: Defeat the Twin Furies in hard mode, solo, without being hit by their 'Lava Bomb' attack. Elite" },
    { "name": "Bring the Roof Down, But Not On Me: Defeat Vorago without anyone being hit by any falling rocks during the 'Ceiling Collapse' stage. Elite" },
    { "name": "Calculated: Defeat Vorago without anyone activating any of the magic and explosive bombs during the 'The End' stage. Elite" },
    { "name": "Can't touch this I: Defeat Zamorak, Lord of Chaos at 250% or higher enrage without letting him use a special attack. Elite" },
    { "name": "Classic Rock: Defeat Vorago without using any defensive abilities. Elite" },
    { "name": "Cleansing is For the Weak: Defeat Solak, Guardian of the Grove without anyone being cleansed by Merethiel. Elite" },
    { "name": "Clenched: Defeat the Ambassador without destroying any sinister fragments. Elite" },
    { "name": "Come And Have Vorago II: Defeat Vorago, if you think you're hard enough. (X/10) Elite" },
    { "name": "Comeback kid: Defeat Vorago after being pushed close to the edge of the arena during the 'Finale' stage. Elite" },
    { "name": "Commander Zilyana (HM) Elite Speed Killer: Defeat Commander Zilyana in hard mode, solo, in less than 00:42. Elite" },
    { "name": "Conqueror of Chaos: Complete a full run of The Zamorakian undercity and defeat Zamorak. (X/1) Elite" },
    { "name": "Cormes and Goes: Defeat Durzag without killing Cormes. Elite" },
    { "name": "Coursing Through You: Defeat Telos, the Warden at 100% or higher enrage after taking the full damage of the virus in phase 5. Elite" },
    { "name": "Crassian Leviathan Elite Speed Killer: Defeat Crassian Leviathan solo in less than 01:30. Elite" },
    { "name": "Crawfish Boil: Disintegrate 12 crassian ritual keepers simultaneously during the Ambassador encounter. Elite" },
    { "name": "Day at the Aquarium: Defeat Yakamaru with one durable jellyfish and one reflecting jellyfish still alive. Elite" },
    { "name": "Day at the Pound: Defeat Durzag without opening any of the charger cages in the arena walls. Elite" },
    { "name": "Dealing with Scarabs: Defeat Nakatra, Devourer Eternal without letting any Corrupted scarab healer reach her or Volatile scarab akh explode. Elite" },
    { "name": "Definitely Can't Touch This: Defeat Kerapac, the bound in hard mode without being hit by his 'Lightning Strike' attack. Elite" },
    { "name": "Dry as a Bone: Defeat Vorago without anyone hiding behind a waterfall during stage 4. Elite" },
    { "name": "Ex-Ex-Dragon III: Defeat Zemouregal & Vorkath in hard mode. (X/25) Elite" },
    { "name": "Finish Him!: Personally defeat Vorago with the Maul of Omens. Elite" },
    { "name": "Fonts of All Knowledge I: Defeat Telos, the Warden at 100% or higher enrage after charging and using all fonts in phase 5. Elite" },
    { "name": "Freeze Frame: Defeat Vorago without Vorago moving and without anyone moving during the 'Vitalis' stage. Elite" },
    { "name": "Gas Detector: Defeat Vorago without anyone being hit by a Gas Cloud attack during the 'Green Bomb' stage. Elite" },
    { "name": "General Graardor (HM) Elite Speed Killer: Defeat General Graardor in hard mode, solo, in less than 00:24. Elite" },
    { "name": "Get Your Heads in the Game II: Defeat Vermyx, Brood Mother in hard mode. (X/10) Elite" },
    { "name": "Gong Maintenance Expert: Defeat Durzag with all gongs repaired but un-used. Elite" },
    { "name": "Green Thumb: Defeat Solak, Guardian of the Grove after letting all spore bombs hit the ground during his 'Earthen Seed' attack. Elite" },
    { "name": "Gregorovic (HM) Elite Speed Killer: Defeat Gregorovic in hard mode in less than 01:48. Elite" },
    { "name": "Hand To Heal: Defeat the Ambassador without allowing him to heal from his 'Circle of Black Hands' attack. Elite" },
    { "name": "Happy Trails: Defeat the Ambassador without anyone taking any damage from his 'Black Stone Flames' attack. Elite" },
    { "name": "Har-Aken Elite Speed Killer: Defeat the Har-Aken in less than 30:00. Elite" },
    { "name": "Healing in the Name of Bleeds: Defeat Nex solo, after allowing her to fully heal during her Blood phase. Elite" },
    { "name": "Helwyr (HM) Elite Speed Killer: Defeat Helwyr in hard mode in less than 01:30. Elite" },
    { "name": "Here We Rago Again II: Defeat Vorago in hard mode. (X/10) Elite" },
    { "name": "Hold It Right There: Defeat Vorago without allowing him to move forward in stage 5. Elite" },
    { "name": "How Do I Clear This?: Defeat Vorago without anyone clearing his 'Destroy Tank' ability. Elite" },
    { "name": "I Lava This: Defeat the Twin Furies in hard mode, solo, after dealing damage to the Twin Furies using their 'Blue Lava Bomb' attack. Elite" },
    { "name": "I Set Fire To The Rain: Defeat TzKal-Zuk in hard mode in a single run without being hit by his 'Igneous Rain' attack. Elite" },
    { "name": "I Wonder What These Do: Defeat Vorago after activating all of the magic and explosive bombs during the 'The End' stage. Elite" },
    { "name": "If I Could Turn Back Time... I Definitely Wouldn't: Defeat Kerapac, the bound in hard mode without using the 'Warp Time' action ability. Elite" },
    { "name": "In and Out: Defeat Kezalam, the Wanderer without being hit by her 'Sanctum Blast' attack. Elite" },
    { "name": "Inner what?: Defeat Raksha without activating 'Inner power'. Can only be completed in a solo instance. Elite" },
    { "name": "Instability Always Phased Me: Defeat the Ambassador without anyone allowing any of his unstable black holes to explode. Elite" },
    { "name": "Instability Never Phased Me: Defeat the Ambassador after surviving explosions from 4 unstable black holes. Elite" },
    { "name": "It's Coarse and Rough and Irritating: Defeat Nakatra, Devourer Eternal without being sent to the Shadowsands more than once. Elite" },
    { "name": "Its Vision Is Based On Movement: Defeat Vorago without anyone moving during the 'Scopulus' stage once the Scopulus have spawned. Elite" },
    { "name": "Ju-raksha Park III: Defeat Raksha, the Shadow Colossus. (X/25) Elite" },
    { "name": "Just Keep Running: Defeat Rasial, the First Necromancer without being hit by his 'Finger of Death' attack in phase 4. Elite" },
    { "name": "K'ril Tsutsaroth (HM) Elite Speed Killer: Defeat K'ril Tsutsaroth in hard mode, solo, in less than 00:27. Elite" },
    { "name": "Kalphite King (solo): Defeat the Kalphite King solo. Elite" },
    { "name": "Kalphite King Elite Speed Killer: Defeat the Kalphite King in a team of 2 or fewer in less than 00:30. Elite" },
    { "name": "Keep Your Workstation Clear: Defeat the Ambassador after placing all of his 'Black Stone Flames' attack in a single location. Elite" },
    { "name": "Kerapac (HM) Elite Speed Killer: Defeat Kerapac, the bound in hard mode, solo, in less than 06:00. Elite" },
    { "name": "Kerapac Elite Speed Killer: Defeat Kerapac, the bound solo in less than 01:30. Elite" },
    { "name": "Kezalam (HM) Elite Speed Killer: Defeat Kezalam, the Wanderer in hard mode in less than 04:00. Elite" },
    { "name": "Kezalam Elite Speed Killer: Defeat Kezalam, the Wanderer in less than 03:30. Elite" },
    { "name": "Kezalam, the Wanderer (perfect): Defeat Kezalam, the Wanderer without being resurrected while completing the listed achievements. Elite" },
    { "name": "Kree'arra (HM) Elite Speed Killer: Defeat Kree'arra in hard mode, solo, in less than 00:30. Elite" },
    { "name": "Let the Poison In: Defeat Raksha, the Shadow Colossus without expelling any poisonous shadow energy from his 'Mind Flay' attack. Elite" },
    { "name": "Lets Split Up: Defeat Vorago without anyone being hit by his 'Teamsplit' attack during the 'Teamsplit' stage. Elite" },
    { "name": "Lets Stay Together: Defeat Vorago without anyone successfully hiding during the 'Teamsplit' attack. Elite" },
    { "name": "Lightning Strikes Thrice: Defeat Kerapac, the bound after being hit by all 3 waves of his 'Lightning Strike' attack within 3s of each other. Elite" },
    { "name": "Lord of Chaos: Defeat Zamorak, Lord of Chaos in a group at 500% enrage. Elite" },
    { "name": "Lumbridge Strikes Back: Defeat Araxxor and Araxxi whilst wearing bronze armour on your head, torso and legs, and a bronze weapon in your main hand. Can only be completed in solo mode. Elite" },
    { "name": "Make Friends and Influence People: Use asphyxiate on Yakamaru's north pool and have the whole raid survive. Elite" },
    { "name": "Make Way, I'm Coming Through: Complete a flawless run by defeating TzKal-Zuk in a single attempt after completing all of his challenges. Elite" },
    { "name": "Master of Beatings II: Defeat Beastmaster Durzag. (X/10) Elite" },
    { "name": "Masuta Elite Speed Killer: Defeat Masuta the Ascended solo in less than 03:30. Elite" },
    { "name": "Minions Miss Me, Rasial Fears Me: Defeat Rasial, the First Necromancer without being hit by his minions. Elite" },
    { "name": "Nakatra (HM) Elite Speed Killer: Defeat Nakatra, Devourer Eternal in hard mode in less than 05:00. Elite" },
    { "name": "Nakatra Elite Speed Killer: Defeat Nakatra, Devourer Eternal in less than 04:30. Elite" },
    { "name": "Nakatra, Devourer Eternal (perfect): Defeat Nakatra, Devourer Eternal without being resurrected while completing the listed achievements. Elite" },
    { "name": "Nex Elite Speed Killer: Defeat Nex solo in less than 02:15. Elite" },
    { "name": "Nex Pls III: Defeat Nex, the Angel of Death. (X/25) Elite" },
    { "name": "Nex, Angel of Death Elite Speed Killer: Defeat Nex, Angel of Death in a team of 7 or fewer in less than 02:30. Elite" },
    { "name": "Next to No Power: Defeat Nex without the use of prayers by anyone in the group. Elite" },
    { "name": "No Bombs Allowed: Defeat Raksha, the Shadow Colossus without letting him use his 'Shadow Bomb' attack in phase 4. Elite" },
    { "name": "No Friendly Fire: Defeat Vorago without anyone being hit by damage reflected by his 'Target Link' attack. Elite" },
    { "name": "Not Mushroom to Move: Defeat Helwyr solo without moving. Elite" },
    { "name": "One At a Time: Defeat Kerapac, the bound in hard mode, without letting him jump more than once each phase from his 'Jumping Slam' attack. Elite" },
    { "name": "One for All: Defeat Nex, Angel of Death in a team of 7 or fewer without more than one player getting caught in her 'Elemental Lockdown' attack. Elite" },
    { "name": "Out of Orbit: Defeat Astellarn the First Celestial without anyone stabilising a wyrmhole. Elite" },
    { "name": "Parkour!: Defeat Vorago after personally jumping onto Vorago's back in stage 1 in under 35 seconds. Elite" },
    { "name": "Prison Riot: Have at least one goebie survive the fight with Durzag. Elite" },
    { "name": "Raksha Elite Speed Killer: Defeat Raksha, the Shadow Colossus in less than 02:45. Elite" },
    { "name": "Rasial Elite Speed Killer: Defeat Rasial, the First Necromancer in less than 01:30. Elite" },
    { "name": "Rewind: Defeat Yakamaru after defeating all of its images and then allowing it to consume a durable jellyfish. Elite" },
    { "name": "Riding the Anima-storm: Defeat Solak, Guardian of the Grove without anyone siphoning Blight from the Anima storm. Elite" },
    { "name": "Rock Magnet: Defeat Vorago without anyone avoiding any falling rocks during the 'Ceiling Collapse' stage. Elite" },
    { "name": "Sanctum Guardian Elite Speed Killer: Defeat the Sanctum Guardian solo in less than 01:30. Elite" },
    { "name": "Seiryu Elite Speed Killer: Defeat Seiryu the Azure Serpent solo in less than 03:00. Elite" },
    { "name": "Shadow Tank: Defeat Nex solo, without moving during her Shadow phase until Nex has hit 120,000 lifepoints. Elite" },
    { "name": "Should've Wandered Somewhere Else II: Defeat Kezalam, the Wanderer in hard mode. (X/10) Elite" },
    { "name": "Smashing Success: Defeat Vorago in hard mode by personally using the Maul of Omens on him on any rotation. Elite" },
    { "name": "So-lacking any Lashers: Defeat Solak, Guardian of the Grove without letting any Volatile rootling transform into a Blightbound lasher. Elite" },
    { "name": "Solak Elite Speed Killer: Defeat Solak, Guardian of the Grove in less than 06:00. Elite" },
    { "name": "Something In The Air: Defeat Vorago after receiving a total of 5000 damage from his 'Gas Cloud' attack. Elite" },
    { "name": "Splittin' Souls and Smashin' Skulls II: Defeat Nakatra, Devourer Eternal in hard mode. (X/10) Elite" },
    { "name": "Spread the Blight: Defeat Solak, Guardian of the Grove without anyone being hit by a Blight bomb. Elite" },
    { "name": "Stuffed with Anima: Defeat Telos, the Warden at 100% or higher enrage after letting him reach a full anima bar in all 5 phases. Elite" },
    { "name": "Supernova: Defeat Astellarn the First Celestial without anyone killing a 'Pulsar'. Elite" },
    { "name": "Tank and Spank: Defeat Taraket the Necromancer while both the bloated monstrosity and corpse carrier are still alive. Elite" },
    { "name": "Taraket Elite Speed Killer: Defeat Taraket the Necromancer solo in less than 03:00. Elite" },
    { "name": "Target Acquired: Defeat Vorago after he has reflected an Ultimate ability through each of his 'Target Link' attacks. Elite" },
    { "name": "Target Practice: Defeat Solak, Guardian of the Grove without letting any spore bombs hit the ground during his 'Earthen Seed' attack. Elite" },
    { "name": "Telos Elite Speed Killer: Defeat Telos, the Warden at 300% or higher enrage in less than 04:00. Elite" },
    { "name": "Telos If You're Angry IV: Defeat Telos at 500% enrage. (X/500) Elite" },
    { "name": "Telos Where It Hurts III: Defeat Telos. (X/25) Elite" },
    { "name": "The Ambassador Elite Speed Killer: Defeat the Ambassador solo in less than 04:00. Elite" },
    { "name": "The Dragon Did Nothing Wrong: Defeat Zemouregal without killing Vorkath. Elite" },
    { "name": "The Floor Is Poison: Defeat Zemouregal & Vorkath in hard mode without taking damage from poison. Elite" },
    { "name": "The Floor Is Spiky: Defeat Zemouregal & Vorkath in hard mode without taking damage from their 'Bone Spikes' attack. Elite" },
    { "name": "The Magister Elite Speed Killer: Defeat the Magister in less than 00:30. Elite" },
    { "name": "The Mighty Maul: Defeat Vorago by personally using the Maul of Omens on him on every rotation. Elite" },
    { "name": "The One That Speaks But Doesn't Stun: Defeat Raksha, the Shadow Colossus without being stunned by his 'Tail Sweep', 'Trampling Charge' and 'Shadow bomb' attacks. Elite" },
    { "name": "The Symbols, What Do They Mean?!: Defeat Nakatra, Devourer Eternal without being hit by her 'Sanctum Hieroglyphs' attack. Elite" },
    { "name": "The Ultimate Tank Test: Defeat Kerapac, the bound in hard mode without entering an echo's time thread. Elite" },
    { "name": "There's Always Something Behind the Waterfall: Defeat Vorago after mitigating all damage from his 'Waterfall' attack in stage 4. Elite" },
    { "name": "This Blight of Ours: Defeat Solak, Guardian of the Grove after siphoning all Blight from the Anima storm. Elite" },
    { "name": "This Is Not True Power: Defeat Rasial, the First Necromancer without being hit by his 'Volley of Souls' attack. Elite" },
    { "name": "To Bleed Or Not To Bleed: Defeat Vorago without anyone being hit by his 'Destroy Tank' attack in stages 2, 4, and 5. Elite" },
    { "name": "To Me, To You: Defeat Vorago without anyone being hit by a Scopulus during the 'Scopulus' stage. Elite" },
    { "name": "Too cute to kill: Defeat Nex, Angel of Death in a team of 7 or fewer after she absorbs 5 reavers in phase 1. Elite" },
    { "name": "Too Mushroom II: Defeat Helwyr in hard mode, solo, without being hit by his 'Mushroom Explosion' attack. Elite" },
    { "name": "Tormenting the Obelisk: Defeat Kezalam, the Wanderer after destroying each Moonstone obelisk before she finishes charging her attack. Elite" },
    { "name": "Twin Furies (HM) Elite Speed Killer: Defeat the Twin Furies solo in hard mode in less than 00:45. Elite" },
    { "name": "TzKal-Zuk Elite Speed Killer: Defeat TzKal-Zuk in less than 20:00. Elite" },
    { "name": "Verak Lith Elite Speed Killer: Defeat Verak Lith solo in less than 03:00. Elite" },
    { "name": "Vermyx (HM) Elite Speed Killer: Defeat Vermyx, Brood Mother in hard mode in less than 02:30. Elite" },
    { "name": "Vermyx Elite Speed Killer: Defeat Vermyx, Brood Mother in less than 02:15. Elite" },
    { "name": "Vermyx, Brood Mother (perfect): Defeat Vermyx, Brood Mother without being resurrected while completing the listed achievements. Elite" },
    { "name": "Vindicta & Gorvek (HM) Elite Speed Killer: Defeat Vindicta & Gorvek in hard mode in less than 02:00. Elite" },
    { "name": "Vorago (duo): Defeat Vorago in a team of two or fewer. Elite" },
    { "name": "Vorago (HM) (trio): Defeat Vorago in hard mode in a team of three or fewer. Elite" },
    { "name": "Vorago (HM) Elite Speed Killer: Defeat Vorago in hard mode in less than 14:00. Elite" },
    { "name": "Vorago Elite Speed Killer: Defeat Vorago in a team of 4 or fewer in less than 08:30. Elite" },
    { "name": "Weave Come So Far 200: Defeat Araxxi at 200% enrage. Elite" },
    { "name": "What Fragments?: Defeat the Ambassador without letting him absorb any sinister fragments. Elite" },
    { "name": "Wood Kill Again III: Defeat Solak, Guardian of the Grove. (X/25) Elite" },
    { "name": "Xau-take a Leave of Absence: Defeat the Ambassador without anyone intercepting any of his 'Circle of Black Hands' attacks. Elite" },
    { "name": "Yak and Ruin II: Defeat Yakamaru. (X/10) Elite" },
    { "name": "Yakamaru Elite Speed Killer: Defeat Yakamaru in less than 05:30. Elite" },
    { "name": "You Can't Siphon Me: Defeat Solak, Guardian of the Grove without anyone being hit by his 'Blight Siphon' attack. Elite" },
    { "name": "You Really Zuk II: Defeat TzKal-Zuk in hard mode. (X/10) Elite" },
    { "name": "You Zuk II: Defeat TzKal-Zuk. (X/10) Elite" },
    { "name": "You're Not Strong Enough: Defeat Nex, Angel of Death in a team of 7 or fewer without letting any Praesul mages gather their full strength. Elite" },
    { "name": "You're still not strong enough: Defeat Nex, Angel of Death in a team of 7 or fewer after defeating each Praesul at their full strength. Elite" },
    { "name": "Zamo-whacked III: Defeat Zamorak, Lord of Chaos (X/25) Elite" },
    { "name": "Zamorak Elite Speed Killer: Defeat Zamorak, Lord of Chaos at 500% or higher enrage in less than 06:30. Elite" },
    { "name": "Zemouregal & Vorkath (HM) Elite Speed Killer: Defeat Zemouregal & Vorkath in hard mode in less than 05:00. Elite" },
    { "name": "Zemouregal & Vorkath Elite Speed Killer: Defeat Zemouregal & Vorkath in less than 04:00. Elite" },
    { "name": "A Song of Ice and Ire VII: Defeat the Arch-Glacor at 2,000% enrage. Master" },
    { "name": "Anti-anima-golem: Defeat Telos, the Warden at 100% or higher enrage without being hit by an anima-golem. Master" },
    { "name": "Araxxi Master Speed Killer: Defeat Araxxi solo in less than 01:42. Master" },
    { "name": "Arch-Glacor (HM) Master Speed Killer: Defeat the Arch-Glacor in hard mode at 1000% or higher enrage in less than 02:30. Master" },
    { "name": "Are You Winning, Zam? VI: Defeat Zamorak at 1,000% enrage in a solo encounter. Master" },
    { "name": "Are You Winning, Zam? VII: Defeat Zamorak, Lord of Chaos solo at 2,000% enrage. Master" },
    { "name": "Barrows: Rise of the Six Master Speed Killer: Defeat Barrows: Rise of the Six in a team of 4 or fewer in less than 00:06. Master" },
    { "name": "Beastmaster Durzag (duo): Defeat Beastmaster Durzag in a team of 2 or fewer. Master" },
    { "name": "Beastmaster Durzag Master Speed Killer: Defeat Beastmaster Durzag in less than 00:45. Master" },
    { "name": "Before You Go Aken: Defeat TzKal-Zuk in hard mode in a single run without letting TzekHaar-Aken submerge in wave 17. Master" },
    { "name": "Black Stone Dragon Master Speed Killer: Defeat the Black Stone Dragon solo in less than 02:15. Master" },
    { "name": "Blight the Way with Eruptions: Defeat Solak, Guardian of the Grove after dealing with all eruptions within 6s of each other. Master" },
    { "name": "Bomb disposal unit: Defeat Nex, Angel of Death in a team of 7 or fewer after placing each 'Mark of the Elements' in the center of the arena. Master" },
    { "name": "Can't touch this II: Defeat Zamorak, Lord of Chaos at 500% or higher enrage without letting him use a special attack. Master" },
    { "name": "Canon Event: Defeat Kerapac, the bound in hard mode, solo with at least 3 active time thread tears. Master" },
    { "name": "Champion of the Goebies: Complete the Liberation of Mazcab raid in a single run without anyone dying, leaving or banking while completing the listed achievements. Master" },
    { "name": "Chill To The Bone I: Defeat the Arch-Glacor in hard mode for a 100 killstreak. Master" },
    { "name": "Cleaning Up the Shadows: Defeat Raksha, the Shadow Colossus after entering phase 4 with no active shadow pools. Master" },
    { "name": "Connection lost. Please wait - attempting to reestablish: Defeat Rasial, the First Necromancer without moving for 45s after being hit by his 'Finger of Death' attack in phase 4. Master" },
    { "name": "Culling the Blight: Defeat Solak, Guardian of the Grove after defeating his Blight afflicted core in a single exposure. Master" },
    { "name": "Did It For Them: Defeat Nex, Angel of Death in a team of 7 or fewer without allowing any of the 'Unstable Smoke' crystals to explode. Master" },
    { "name": "Do Not Return To Sender: Defeat Nex, Angel of Death in a team of 7 or fewer without letting any reavers be absorbed. Master" },
    { "name": "Don't Go Ballistic: Defeat Zemouregal & Vorkath in hard mode without using the ballista. Master" },
    { "name": "Don't Let Him Sweep the Leg: Defeat Raksha, the Shadow Colossus without letting him use his 'Tail Sweep' attack in phase 4. Master" },
    { "name": "Don't touch that!: Defeat Nex, Angel of Death in a team of 7 or fewer without anyone activating the 'Unstable Smoke' crystal. Master" },
    { "name": "Excuse Me, That's My Seat: Complete a hardmode flawless run by defeating TzKal-Zuk in a single attempt after completing all of his challenges. Master" },
    { "name": "Flipping the Script: Defeat TzKal-Zuk in hard mode in a single run after defeating all Igneous minions in reverse order during his 'Infernal Rain' attack in wave 18. Master" },
    { "name": "Flow State: Defeat Raksha, the Shadow Colossus after using the correct protection prayer against all of his basic attacks. Master" },
    { "name": "Fonts of All Knowledge II: Defeat Telos, the Warden at 1000% or higher enrage after charging and using all fonts in phase 5. Master" },
    { "name": "Ful of Energy but Nowhere to Go: Defeat TzKal-Zuk in hard mode in a single run without moving after attacking the 'Conduit of Ful' in wave 18. Master" },
    { "name": "Gorilla Warfare: Defeat Nakatra, Devourer Eternal in hard mode after defeating both Shadowsands gorilla akhs. Master" },
    { "name": "Healing Denied: Defeat Nakatra, Devourer Eternal in hard mode without letting her heal Nefthys, the Split Soul. Master" },
    { "name": "Heatproof: Defeat Zemouregal & Vorkath in hard mode without using any form of dragonfire protection. Master" },
    { "name": "Hungry Hungry Reavers: Defeat Nex, Angel of Death in a team of 7 or fewer without anyone damaging any of the blood reavers. Master" },
    { "name": "I said E, not E!: Defeat Zamorak, Lord of Chaos at 750% or higher enrage after killing the incorrect rune in phase 7 without anyone dying. Master" },
    { "name": "I wanted to show you this thing, but now you must die: Defeat Nex, Angel of Death in a team of 7 or fewer after defeating each of Nex's mages in phase 4. Master" },
    { "name": "I'm Watching You: Defeat Zemouregal & Vorkath in hard mode without allowing Zemouregal to stun you. Master" },
    { "name": "Icy-them-coming: Defeat Nex, Angel of Death in a team of 7 or fewer without anyone taking damage from her 'Icicle Slam' attack. Master" },
    { "name": "Keeping a Healthy State of Mind: Defeat Solak, Guardian of the Grove while his remaining conscience within his mind has at least 50% life points remaining. Master" },
    { "name": "Kerapac (HM) Master Speed Killer: Defeat Kerapac, the bound in hard mode, solo, in less than 03:00. Master" },
    { "name": "Kezalam (HM) Master Speed Killer: Defeat Kezalam, the Wanderer in hard mode in less than 02:00. Master" },
    { "name": "Kezalam, the Wanderer (HM) (perfect): Defeat Kezalam, the Wanderer in hard mode while completing the listed achievements. Master" },
    { "name": "Lashers are Friends Not Foes: Defeat Solak, Guardian of the Grove with at least 8 active Blightbound lashers. Master" },
    { "name": "Lord of Chaos (Silver): Defeating Zamorak, Lord of Chaos in a group at 2,000% enrage. Master" },
    { "name": "Maul or Nothing: Defeat Vorago in hard mode in a team size of 2 or fewer by personally using the Maul of Omens on him on every rotation. Master" },
    { "name": "Nakatra (HM) Master Speed Killer: Defeat Nakatra, Devourer Eternal in hard mode in less than 03:00. Master" },
    { "name": "Nakatra, Devourer Eternal (HM) (perfect): Defeat Nakatra, Devourer Eternal in hard mode while completing the listed achievements. Master" },
    { "name": "Nex Master Speed Killer: Defeat Nex solo in less than 01:21. Master" },
    { "name": "Nex, Angel of Death (duo): Defeat Nex, Angel of Death in a team of 2 or fewer. Master" },
    { "name": "Nex, Angel of Death Master Speed Killer: Defeat Nex, Angel of Death in a team of 7 or fewer in less than 01:21. Master" },
    { "name": "No smoking: Defeat Nex, Angel of Death in a team of 7 or fewer without anyone taking damage from her 'Smoke Blades' attack. Master" },
    { "name": "One Hop This Time: Defeat Seiryu solo without jumping onto his manacles more than once. Master" },
    { "name": "Paying No Mind to His Mind: Defeat Solak, Guardian of the Grove without anyone entering his mind in phase 4. Master" },
    { "name": "Poppin' pillars: Defeat Nex, Angel of Death in a team of 7 or fewer after defeating all four pillars within 15 seconds. Master" },
    { "name": "Pruning the Timeline: Defeat Kerapac, the bound in hard mode, solo after dealing with all echos of Kerapac within 9s of each other. Master" },
    { "name": "Raksha Master Speed Killer: Defeat Raksha, the Shadow Colossus in less than 01:42. Master" },
    { "name": "Rasial Master Speed Killer: Defeat Rasial, the First Necromancer in less than 01:00. Master" },
    { "name": "Rasial, the First Necromancer (perfect): Defeat Rasial, the First Necromancer while completing the listed achievements. Master" },
    { "name": "Rocks Keep Falling On My Head: Defeat Raksha, the Shadow Colossus without moving during his 'Colossal Stomp' attack. Master" },
    { "name": "Scenario 7: Defeat Raksha after letting him reach 100% shadow energy in the first phase. Can only be completed in a solo instance. Master" },
    { "name": "Seiryu Master Speed Killer: Defeat Seiryu the Azure Serpent solo in less than 01:30. Master" },
    { "name": "Single Sigil Solutions: Defeat Solak, Guardian of the Grove after using only one sigil to defeat Erethdor while Solak has at least 30% life points remaining. Master" },
    { "name": "Smoking area: Defeat Nex, Angel of Death in a team of 7 or fewer after having everyone tank all damage from her 'Smoke Blades' attack. Master" },
    { "name": "So icy: Defeat Nex, Angel of Death in a team of 7 or fewer without anyone being freed from her 'Icicle Slam' attack. Master" },
    { "name": "Solak Master Speed Killer: Defeat Solak, Guardian of the Grove in less than 03:45. Master" },
    { "name": "Stunlocked: Defeat Zamorak, Lord of Chaos at 750% or higher enrage after not stunning Zamorak during the 'Infernal Tomb' or 'Decimate' attack and taking the full damage. Master" },
    { "name": "Telos About Your Streak I: Defeat Telos, the Warden for a 100 killstreak. Master" },
    { "name": "Telos If You're Angry VII: Defeat Telos, the Warden at 2,000% enrage. Master" },
    { "name": "Telos Master Speed Killer: Defeat Telos, the Warden at 1000% or higher enrage in less than 03:15. Master" },
    { "name": "The Ambassador Master Speed Killer: Defeat the Ambassador solo in less than 02:30. Master" },
    { "name": "The Dragon Really Did Nothing Wrong: Defeat Zemouregal in hard mode without killing Vorkath. Master" },
    { "name": "The Magister Master Speed Killer: Defeat the Magister in less than 00:12. Master" },
    { "name": "Three Jads Don't Scare Me: Defeat TzKal-Zuk in hard mode in a single run without moving from the challenger's tile in wave 16. Master" },
    { "name": "TzKal-Zuk (HM) Master Speed Killer: Defeat TzKal-Zuk in hard mode in less than 16:00. Master" },
    { "name": "TzKal-Zuk Master Speed Killer: Defeat TzKal-Zuk in less than 12:30. Master" },
    { "name": "Ultra Instinct: Defeat Raksha without letting him gain any shadow energy. Can only be completed in a solo instance. Master" },
    { "name": "Unpr-edict-able: Defeat Zamorak, Lord of Chaos at 750% or higher enrage after activating the edicts in order of: 3, 5, 6, 1, 4, 2 (H, V, E2, B, A, E1). Master" },
    { "name": "Vermyx (HM) Master Speed Killer: Defeat Vermyx, Brood Mother in hard mode in less than 01:21. Master" },
    { "name": "Vermyx, Brood Mother (HM) (perfect): Defeat Vermyx, Brood Mother in hard mode while completing the listed achievements. Master" },
    { "name": "Vorago (HM) (duo): Defeat Vorago in hard mode in a team of two or fewer. Master" },
    { "name": "Vorago (HM) Master Speed Killer: Defeat Vorago in hard mode in a team of 4 or fewer in less than 11:00. Master" },
    { "name": "Vorago (solo): Defeat Vorago solo. Master" },
    { "name": "Vorago Master Speed Killer: Defeat Vorago in a team of 2 or fewer in less than 07:15. Master" },
    { "name": "Waiting For His Turn: Defeat Telos, the Warden at 1000% or higher enrage without letting him use his basic attack in phase 4. Master" },
    { "name": "Weave Come So Far 300: Defeat Araxxi at 300% enrage. Master" },
    { "name": "Welcome to Gielinor, it's cooler here: Defeat Zamorak, Lord of Chaos at 750% or higher enrage while letting every Chaos demon leave Infernus. Master" },
    { "name": "Working With Myself: Defeat Kerapac, the bound in hard mode, solo without letting any of your echoes die. Master" },
    { "name": "Yakamaru Master Speed Killer: Defeat Yakamaru in less than 03:00. Master" },
    { "name": "You. Shall. Not. Shield.: Defeat Zamorak, Lord of Chaos at 750% or higher enrage without anyone using shield defensive abilities. Master" },
    { "name": "You're coming home with me: Defeat Zamorak, Lord of Chaos at 750% or higher enrage while keeping the Chaos Demon alive in phase 7. Master" },
    { "name": "Zamorak Master Speed Killer: Defeat Zamorak, Lord of Chaos at 1000% or higher enrage in less than 05:12. Master" },
    { "name": "Zemouregal & Vorkath (HM) Master Speed Killer: Defeat Zemouregal & Vorkath in hard mode in less than 02:45. Master" },
    { "name": "Arch-Glacor (HM) Grandmaster Speed Killer: Defeat the Arch-Glacor in hard mode at 3000% or higher enrage in less than 05:30. Grandmaster" },
    { "name": "Beastmaster Durzag (solo): Defeat Beastmaster Durzag solo. Grandmaster" },
    { "name": "Beastmaster Durzag Grandmaster Speed Killer: Defeat Beastmaster Durzag in less than 00:27. Grandmaster" },
    { "name": "Black Stone Dragon Grandmaster Speed Killer: Defeat the Black Stone Dragon solo in less than 01:45. Grandmaster" },
    { "name": "Can't touch this III: Defeat Zamorak, Lord of Chaos at 750% or higher enrage without letting him use a special attack. Grandmaster" },
    { "name": "Chill To The Bone II: Defeat the Arch-Glacor in hard mode for a 200 killstreak. Grandmaster" },
    { "name": "Kerapac (HM) Grandmaster Speed Killer: Defeat Kerapac, the bound in hard mode, solo, in less than 02:15. Grandmaster" },
    { "name": "Kerapac, the bound (perfect): Defeat Kerapac, the bound in hard mode, solo while completing the listed achievements. Grandmaster" },
    { "name": "Kerapac, the bound (unorthodox): Defeat Kerapac, the bound in hard mode, solo while completing the listed achievements. Grandmaster" },
    { "name": "Lord of Chaos (Gold): Defeating Zamorak, Lord of Chaos in a group at 4,000% enrage. Grandmaster" },
    { "name": "Maul and Brawl: Defeat Vorago in hard mode, solo, by personally using the Maul of Omens on him on every rotation. Grandmaster" },
    { "name": "Nakatra (HM) Grandmaster Speed Killer: Defeat Nakatra, Devourer Eternal in hard mode in less than 02:24. Grandmaster" },
    { "name": "Nex, Angel of Death (perfect): Defeat Nex, Angel of Death in a team of 5 or fewer without anyone dying while completing the listed achievements. Grandmaster" },
    { "name": "Nex, Angel of Death (solo): Defeat Nex, Angel of Death solo. Grandmaster" },
    { "name": "Nex, Angel of Death (unorthodox): Defeat Nex, Angel of Death in a team of 5 or fewer without anyone dying while completing the listed achievements. Grandmaster" },
    { "name": "Nex, Angel of Death Grandmaster Speed Killer: Defeat Nex, Angel of Death in a team of 7 or fewer in less than 01:06. Grandmaster" },
    { "name": "Raksha Grandmaster Speed Killer: Defeat Raksha, the Shadow Colossus in less than 01:15. Grandmaster" },
    { "name": "Raksha, the Shadow Colossus (perfect): Defeat Raksha, the Shadow Colossus, solo while completing the listed achievements. Grandmaster" },
    { "name": "Raksha, the Shadow Colossus (unorthodox): Defeat Raksha, the Shadow Colossus, solo while completing the listed achievements. Grandmaster" },
    { "name": "Reclaiming their Anima: Defeat Telos, the Warden at 4000% enrage after killing all anima-golems in phases 4 and 5. Grandmaster" },
    { "name": "Sanctum of Rebirth (perfect): Complete the Sanctum of Rebirth dungeon in hard mode in a single run without anyone dying or leaving while completing the listed achievements. Grandmaster" },
    { "name": "Seiryu Grandmaster Speed Killer: Defeat Seiryu the Azure Serpent solo in less than 01:00. Grandmaster" },
    { "name": "Solak Grandmaster Speed Killer: Defeat Solak, Guardian of the Grove in less than 02:36. Grandmaster" },
    { "name": "Solak, Guardian of the Grove (perfect): Defeat Solak, Guardian of the Grove while completing the listed achievements. Grandmaster" },
    { "name": "Solak, Guardian of the Grove (unorthodox): Defeat Solak, Guardian of the Grove while completing the listed achievements. Grandmaster" },
    { "name": "Telos About Your Streak II: Defeat Telos, the Warden for a 200 killstreak. Grandmaster" },
    { "name": "Telos Grandmaster Speed Killer: Defeat Telos, the Warden at 4000% or higher enrage in less than 02:30. Grandmaster" },
    { "name": "The Ambassador Grandmaster Speed Killer: Defeat the Ambassador solo in less than 1:45. Grandmaster" },
    { "name": "The True Iceborn: Defeat the Arch-Glacor at 4,000% enrage. Grandmaster" },
    { "name": "The True Warden: Defeat Telos, the Warden at 4,000% enrage. Grandmaster" },
    { "name": "TzKal-Zuk (HM) Grandmaster Speed Killer: Defeat TzKal-Zuk in hard mode in less than 13:30. Grandmaster" },
    { "name": "Unleash the Font: Defeat Telos, the Warden at 4000% enrage after charging and using a font in phase 5. Grandmaster" },
    { "name": "Vorago (HM) (perfect): Defeat Vorago in hard mode while completing the listed achievements. Grandmaster" },
    { "name": "Vorago (HM) (solo): Defeat Vorago in hard mode solo. Grandmaster" },
    { "name": "Vorago (HM) (unorthodox): Defeat Vorago in hard mode while completing the listed achievements. Grandmaster" },
    { "name": "Vorago (HM) Grandmaster Speed Killer: Defeat Vorago in hard mode in a team of 4 or fewer in less than 09:30. Grandmaster" },
    { "name": "Vorago Grandmaster Speed Killer: Defeat Vorago in a team of 2 or fewer in less than 06:30. Grandmaster" },
    { "name": "Wrath of Chaos: Defeat Zamorak, Lord of Chaos solo at 4,000% enrage. Grandmaster" },
    { "name": "Yakamaru (duo): Defeat Yakamaru in a team of 2 or fewer. Grandmaster" },
    { "name": "Yakamaru Grandmaster Speed Killer: Defeat Yakamaru in less than 02:30. Grandmaster" },
    { "name": "Zamehameha: Defeat Zamorak, Lord of Chaos at 1,000% or higher enrage after letting him fully charge his world-ending attack in phase 7. Grandmaster" },
    { "name": "Zamorak Grandmaster Speed Killer: Defeat Zamorak, Lord of Chaos at 2000% or higher enrage in less than 05:12. Grandmaster" },
    { "name": "Zamorak, Lord of Chaos (unorthodox): Defeat Zamorak, Lord of Chaos at 750% or higher enrage while completing the listed achievements. Grandmaster" },
    { "name": "Zemouregal & Vorkath (HM) Grandmaster Speed Killer: Defeat Zemouregal & Vorkath in hard mode in less than 01:45. Grandmaster" },
]
