{  
  "In-game Achievements": [
    { "name": "A Quest for Understanding: Defeat Astellarn while at least two pulsars are still active." },
    { "name": "A Song of Ice and Ire IV: Defeat the Arch-Glacor at 500% enrage. (X/500)" },
    { "name": "A Song of Ice and Ire VII: Defeat the Arch-Glacor at 2,000% enrage." },
    { "name": "All Aboard: Defeat Kree'arra after allowing him to push you from one wall to another with his wing knockback. Can only be completed in a solo instance." },
    { "name": "Anti-anima-golem: Defeat Telos, the Warden at 100% or higher enrage without being hit by an anima-golem." },
    { "name": "Araxxi Elite Speed Killer: Defeat Araxxi solo in less than 03:00." },
    { "name": "Araxxi Master Speed Killer: Defeat Araxxi solo in less than 01:42." },
    { "name": "Arch-Glacor (HM) Elite Speed Killer: Defeat the Arch-Glacor in hard mode at 500% or higher enrage in less than 05:00." },
    { "name": "Arch-Glacor (HM) Grandmaster Speed Killer: Defeat the Arch-Glacor in hard mode at 3000% or higher enrage in less than 05:30." },
    { "name": "Arch-Glacor (HM) Master Speed Killer: Defeat the Arch-Glacor in hard mode at 1000% or higher enrage in less than 02:30." },
    { "name": "Are You Graardone yet?: Defeat General Graardor in hard mode, solo, without being hit by damage reflected by his 'Graardor Protect' attack." },
    { "name": "Are You Winning, Zam? IV: Defeat Zamorak at 500% enrage in a solo encounter." },
    { "name": "Are You Winning, Zam? VI: Defeat Zamorak at 1,000% enrage in a solo encounter." },
    { "name": "Are You Winning, Zam? VII: Defeat Zamorak, Lord of Chaos solo at 2,000% enrage." },
    { "name": "Astellarn Elite Speed Killer: Defeat Astellarn solo in less than 01:00." },
    { "name": "Barrows: Rise of the Six (solo): Defeat Barrows: Rise of the Six solo." },
    { "name": "Beastmaster Durzag (solo): Defeat Beastmaster Durzag solo." },
    { "name": "Beetlejuice Beetlejuice: Defeat the Kalphite King in a team of 4 or fewer without anyone dying to a 'Beetlejuice' attack." },
    { "name": "Between a Rock and a Graard-place: Defeat General Graardor in hard mode, solo, without taking damage from his 'Graardor Smash' attack." },
    { "name": "Blade Dancer: Defeat Gregorovic solo without being hit by his 'Glaives' attack." },
    { "name": "Burrowed Time: Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his 'Burrow' attacks." },
    { "name": "Can't Touch This: Defeat Kerapac, the bound without getting hit by his 'Lightning Strike' attack." },
    { "name": "Canon Event: Defeat Kerapac, the bound in hard mode, solo with at least 3 active time thread tears." },
    { "name": "Classic Dragon Killing: Defeat Vindicta & Gorvek solo whilst having equipped a shield that provides protection against dragonfire." },
    { "name": "Cleaning Up the Shadows: Defeat Raksha, the Shadow Colossus after entering phase 4 with no active shadow pools." },
    { "name": "Cleaving the Way: Defeat Araxxor and Araxxi without anyone being hit by their 'Cleave' attack." },
    { "name": "Cold Spell: Defeat Nex solo, without being hit by her 'Contain' and 'Ice Prison' attacks during her Ice phase." },
    { "name": "Connection lost. Please wait - attempting to reestablish: Defeat Rasial, the First Necromancer without moving for 45s after being hit by his 'Finger of Death' attack in phase 4." },
    { "name": "Core Problem: Defeat the Corporeal Beast without being hit by the Dark Energy Core. Can only be completed in a solo instance." },
    { "name": "Coursing Through You: Defeat Telos, the Warden at 100% or higher enrage after taking the full damage of the virus in phase 5." },
    { "name": "Currently Shockproof: Defeat Pthentraken solo after mitigating her 'Converging Lightning' attack using insulated boots." },
    { "name": "Definitely Can't Touch This: Defeat Kerapac, the bound in hard mode without being hit by his 'Lightning Strike' attack." },
    { "name": "Did You Say Something?: Defeat Osseous solo without being stunned by her 'Roar' attack." },
    { "name": "Did you feel that?: Defeat the Queen Black Dragon after surviving a full time stop special attack." },
    { "name": "Don't Go Ballistic: Defeat Zemouregal & Vorkath in hard mode without using the ballista." },
    { "name": "Don't Let Him Sweep the Leg: Defeat Raksha, the Shadow Colossus without letting him use his 'Tail Sweep' attack in phase 4." },
    { "name": "Don't Need No Help: Defeat Zemouregal & Vorkath without triggering the optional rituals." },
    { "name": "Double Swoop: Defeat Kree'arra solo after defeating all of his lieutenants twice." },
    { "name": "Dry as a Bone: Defeat Vorago without anyone hiding behind a waterfall during stage 4." },
    { "name": "Dry-ish: Defeat Araxxor and Araxxi while at least 40% (Duo: 80%) of the total acid remains in the pool after taking the Acid path during phase 2." },
    { "name": "Extinction Event: Defeat the Rex Matriarchs, Pthentraken, Orikalka, and Rathis, all within 5 seconds of each other. Can only be completed in a solo instance." },
    { "name": "Feeling Flameproof: Defeat the King Black Dragon while using dragonfire protection to mitigate his attacks." },
    { "name": "Feeling a Little Venomous Today: Defeat Rathis solo after stopping her from healing during her 'Poison absorption' attack." },
    { "name": "Finish Him!: Personally defeat Vorago with the Maul of Omens." },
    { "name": "Floor is Larval: Defeat Queen Black Dragon after killing 30 grotworms during the fight. Can only be completed in a solo instance." },
    { "name": "Flow State (achievement): Defeat Raksha, the Shadow Colossus after using the correct protection prayer against all of his basic attacks." },
    { "name": "Fonts of All Knowledge I: Defeat Telos, the Warden at 100% or higher enrage after charging and using all fonts in phase 5." },
    { "name": "Fonts of All Knowledge II: Defeat Telos, the Warden at 1000% or higher enrage after charging and using all fonts in phase 5." },
    { "name": "Free Spirits: Defeat Gregorovic solo without allowing him to absorb any spirits." },
    { "name": "Get Shredded: Defeat the Crassian Leviathan after taking at least 30,000 damage from its sweep attack." },
    { "name": "Getting Ahead of Things: Defeat the Crassian Leviathan without anyone being hit by its 'Head Sweep' attack." },
    { "name": "Glutton for Punishment: Get the Corporeal Beast to devour a variety of delicious familiars. Can only be completed in a solo instance. (X/7)" },
    { "name": "Good Enough for a Goblin: Defeat Corporeal Beast using only a bronze spear. Can only be completed in a solo instance." },
    { "name": "Hail to the Queen: Defeat two Kalphite Guardians whilst fighting Kalphite Queen and then defeat her. Can only be completed in a solo instance." },
    { "name": "Harassing the Crassian: Defeat the Crassian Leviathan after allowing it to fully regenerate from below half health." },
    { "name": "Healing in the Name of Bleeds: Defeat Nex solo, after allowing her to fully heal during her Blood phase." },
    { "name": "Heatproof: Defeat Zemouregal & Vorkath in hard mode without using any form of dragonfire protection." },
    { "name": "Helwyr (HM) Elite Speed Killer: Defeat Helwyr in hard mode in less than 01:30." },
    { "name": "Here is my Handle: Defeat the Sanctum Guardian after being hit by her 'Water Spout' 10 times." },
    { "name": "Here is my Spout: Defeat the Sanctum Guardian without anyone being hit by her 'Water Spout' attack." },
    { "name": "Hydra Halitosis: Defeat the Crassian Leviathan without ever being stunned." },
    { "name": "I Can Feel It In My Fingers: Defeat the Magister after becoming 50% corrupted." },
    { "name": "I Got This: Defeat each of the six Legiones consecutively without leaving the Ascension dungeon." },
    { "name": "I Hold Your Oath Fulfilled: Defeat Rasial, the First Necromancer without being hit by his 'Ghost Wall' attack." },
    { "name": "I Think You Forgot Something: Defeat the Magister after hitting him with his 'Unstable Mixture' attack." },
    { "name": "I was Lightning, Before the Thunder: Defeat Pthentraken solo without being hit by her 'Converging Lightning' attack." },
    { "name": "I'm Warming Up To It: Defeat Orikalka solo after reducing the effects of her 'Frostbite' attack using 'Pyroclastic Shock'." },
    { "name": "I'm Watching You: Defeat Zemouregal & Vorkath in hard mode without allowing Zemouregal to stun you." },
    { "name": "If I Could Turn Back Time... I Definitely Wouldn't: Defeat Kerapac, the bound in hard mode without using the 'Warp Time' action ability." },
    { "name": "If I Could Turn Back Time... I Wouldn't: Defeat Kerapac, the bound without using the 'Warp Time' action ability." },
    { "name": "In the Spirit of Things: Defeat Gregorovic solo without dealing any damage to his spirits." },
    { "name": "Inner what?: Defeat Raksha without activating 'Inner power'. Can only be completed in a solo instance." },
    { "name": "It's Not Nice to Throw Things: Defeat the Magister without being hit by his 'Unstable Mixture' attack." },
    { "name": "Just Keep Running: Defeat Rasial, the First Necromancer without being hit by his 'Finger of Death' attack in phase 4." },
    { "name": "Kalphite King (solo): Defeat the Kalphite King solo." },
    { "name": "Kerapac (HM) Elite Speed Killer: Defeat Kerapac, the bound in hard mode, solo, in less than 06:00." },
    { "name": "Kerapac (HM) Grandmaster Speed Killer: Defeat Kerapac, the bound in hard mode, solo, in less than 02:15." },
    { "name": "Kerapac (HM) Master Speed Killer: Defeat Kerapac, the bound in hard mode, solo, in less than 03:00." },
    { "name": "Kerapac Competent Speed Killer: Defeat Kerapac, the bound solo in less than 03:00." },
    { "name": "Kerapac Elite Speed Killer: Defeat Kerapac, the bound solo in less than 01:30." },
    { "name": "Kerapac, the bound (perfect): Defeat Kerapac, the bound in hard mode, solo while completing the listed achievements." },
    { "name": "Kerapac, the bound (unorthodox): Defeat Kerapac, the bound in hard mode, solo while completing the listed achievements." },
    { "name": "Layering Up: Don't allow the Chaos Elemental's 'Madness' attack to unequip something you're wearing." },
    { "name": "Legiones Competent Speed Killer: Defeat any of the six Ascension Legiones solo in less than 00:18." },
    { "name": "Let the Poison In: Defeat Raksha, the Shadow Colossus without expelling any poisonous shadow energy from his 'Mind Flay' attack." },
    { "name": "Light sensitivity: Defeat Araxxor and Araxxi without anyone standing in the light after taking the Darkness path during phase 2." },
    { "name": "Lightning Doesn't Strike Once: Defeat any of the six Legiones solo without being hit by their 'Lightning' attack." },
    { "name": "Lightning Rod: Defeat Commander Zilyana in hard mode, solo, without being hit by her 'Lightning' attack." },
    { "name": "Lightning Strikes Thrice: Defeat Kerapac, the bound after being hit by all 3 waves of his 'Lightning Strike' attack within 3s of each other." },
    { "name": "Lumbridge Strikes Back: Defeat Araxxor and Araxxi whilst wearing bronze armour on your head, torso and legs, and a bronze weapon in your main hand. Can only be completed in solo mode." },
    { "name": "Matricide: Defeat Nex while accompanied by each of the nihil followers." },
    { "name": "Minions Miss Me, Rasial Fears Me: Defeat Rasial, the First Necromancer without being hit by his minions." },
    { "name": "My Spirit of War Has No Pathetic Attacks: Defeat Hermod, the Spirit of War without being hit by its 'Obliterate' attack." },
    { "name": "Naturist: Allow the Chaos Elemental's 'Madness' attack to unequip something you're wearing five times." },
    { "name": "Never Eat Silk Worms: Get charged by the Kalphite King to each side of the arena and then defeat him." },
    { "name": "Nex Competent Speed Killer: Defeat Nex solo in less than 03:00." },
    { "name": "Nex Elite Speed Killer: Defeat Nex solo in less than 02:15." },
    { "name": "Nex Master Speed Killer: Defeat Nex solo in less than 01:21." },
    { "name": "Nex, Angel of Death (solo): Defeat Nex, Angel of Death solo." },
    { "name": "Next to No Power: Defeat Nex without the use of prayers by anyone in the group." },
    { "name": "No Bombs Allowed: Defeat Raksha, the Shadow Colossus without letting him use his 'Shadow Bomb' attack in phase 4." },
    { "name": "Not Mushroom to Move: Defeat Helwyr solo without moving." },
    { "name": "Orange You Glad I didn't say Blue?: Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his orange 'Bomb' attacks." },
    { "name": "Out of Orbit: Defeat Astellarn the First Celestial without anyone stabilizing a wyrmhole." },
    { "name": "Outflanked 'em in the Sanctum: Defeat the Sanctum Guardian without anyone taking any damage from her purple corruption." },
    { "name": "Parkour!: Defeat Vorago after personally jumping onto Vorago's back in stage 1 in under 35 seconds." },
    { "name": "Paying No Mind to His Mind: Defeat Solak, Guardian of the Grove without anyone entering his mind in phase 4." },
    { "name": "Permanent Exile: Defeat the exiled Kalphite Queen solo." },
    { "name": "Pruning the Timeline: Defeat Kerapac, the bound in hard mode, solo after dealing with all echos of Kerapac within 9s of each other." },
    { "name": "Queen Black Dragon Beginner Speed Killer: Defeat the Queen Black Dragon in less than 02:00." },
    { "name": "Queen Black Dragon Competent Speed Killer: Defeat the Queen Black Dragon in less than 01:30." },
    { "name": "Raksha Elite Speed Killer: Defeat Raksha, the Shadow Colossus in less than 02:45." },
    { "name": "Raksha Grandmaster Speed Killer: Defeat Raksha, the Shadow Colossus in less than 01:15." },
    { "name": "Raksha Master Speed Killer: Defeat Raksha, the Shadow Colossus in less than 01:42." },
    { "name": "Raksha Mechanical (unorthodox): Defeat Raksha, the Shadow Colossus, solo while completing the listed achievements." },
    { "name": "Raksha, the Shadow Colossus (perfect): Defeat Raksha, the Shadow Colossus, solo while completing the listed achievements." },
    { "name": "Rasial Competent Speed Killer: Defeat Rasial, the First Necromancer in less than 02:30." },
    { "name": "Rasial Elite Speed Killer: Defeat Rasial, the First Necromancer in less than 01:30." },
    { "name": "Rasial Master Speed Killer: Defeat Rasial, the First Necromancer in less than 01:00." },
    { "name": "Rasial, the First Necromancer (perfect): Defeat Rasial, the First Necromancer while completing the listed achievements." },
    { "name": "Ready, Set, Go!: Defeat Kerapac, the bound without being hit by his 'Jumping Slam' attack." },
    { "name": "Reclaiming their Anima: Defeat Telos, the Warden at 4000% enrage after killing all anima-golems in phases 4 and 5." },
    { "name": "Rocks Keep Falling On My Head: Defeat Raksha, the Shadow Colossus without moving during his 'Colossal Stomp' attack." },
    { "name": "Safety Dance: Avoid being damaged by twenty of the Queen Black Dragon's fire waves without defeat. Can only be completed in a solo instance." },
    { "name": "Sanctum Guardian Competent Speed Killer: Defeat the Sanctum Guardian solo in less than 02:15." },
    { "name": "Sanctum Guardian Elite Speed Killer: Defeat the Sanctum Guardian solo in less than 01:30." },
    { "name": "Scenario 7: Defeat Raksha after letting him reach 100% shadow energy in the first phase. Can only be completed in a solo instance." },
    { "name": "Shadow Run: Defeat Nex solo, without being hit by her 'Shadow Smash' attack during her Shadow phase." },
    { "name": "Shadow Tank: Defeat Nex solo, without moving during her Shadow phase until Nex has hit 120,000 lifepoints." },
    { "name": "Shatterproof: Defeat Kerapac, the bound without letting him send a rift of time from his 'Shatter' attack." },
    { "name": "Slide to the Right: Defeat the Crassian Leviathan without anyone being hit by its 'Poisonous Breath' attack." },
    { "name": "Sniper No Sniping: Defeat Vindicta & Gorvek solo after using the correct protection prayer against their ranged attacks." },
    { "name": "Soulely a distraction: Defeat Vermyx, Brood Mother after redirecting all souls." },
    { "name": "Spread the Blight: Defeat Solak, Guardian of the Grove without anyone being hit by a Blight bomb." },
    { "name": "Stand Your Ground: Defeat each of the six Legiones without moving." },
    { "name": "Staying Close: Defeat the Twin Furies solo without being hit by Nymora's 'Rain Death' attack." },
    { "name": "Stop Time Stop: Defeat the Queen Black Dragon after cancelling the time stop attack." },
    { "name": "Stop stepping on those!: Defeat the Queen Black Dragon after having killed a Tortured Soul by only damaging them with chaos clouds." },
    { "name": "Stuffed with Anima: Defeat Telos, the Warden at 100% or higher enrage after letting him reach a full anima bar in all 5 phases." },
    { "name": "Stunned and Done: Defeat the Giant Mole solo after stunning her during her 'Berserk' attack." },
    { "name": "Sunshine Through the Rain: Defeat Commander Zilyana in hard mode, solo, whilst under the effects of her 'Lightning' attack and the Sunshine ability." },
    { "name": "Supernova: Defeat Astellarn the First Celestial without anyone killing a 'Pulsar'." },    
    { "name": "Telos Elite Speed Killer: Defeat Telos, the Warden at 300% or higher enrage in less than 04:00." },
    { "name": "Telos Grandmaster Speed Killer: Defeat Telos, the Warden at 4000% or higher enrage in less than 02:30." },
    { "name": "Telos If You're Angry IV: Defeat Telos at 500% enrage. (X/500)" },
    { "name": "Telos If You're Angry VII: Defeat Telos, the Warden at 2,000% enrage." },
    { "name": "Telos Master Speed Killer: Defeat Telos, the Warden at 1000% or higher enrage in less than 03:15." },
    { "name": "That's My Soul: Defeat the Magister after cancelling his 'Soul Siphon' attack." },
    { "name": "The Dragon Did Nothing Wrong: Defeat Zemouregal without killing Vorkath." },
    { "name": "The Dragon Really Did Nothing Wrong: Defeat Zemouregal in hard mode without killing Vorkath." },
    { "name": "The Fire Outside is Frightful: Defeat Verak Lith without being hit by their 'Flame Vortex' attack." },
    { "name": "The Floor Is Poison: Defeat Zemouregal & Vorkath in hard mode without taking damage from poison." },
    { "name": "The Floor Is Spiky: Defeat Zemouregal & Vorkath in hard mode without taking damage from their 'Bone Spikes' attack." },
    { "name": "The Magister Competent Speed Killer: Defeat the Magister in less than 00:45." },
    { "name": "The Magister Elite Speed Killer: Defeat the Magister in less than 00:30." },
    { "name": "The Magister Master Speed Killer: Defeat the Magister in less than 00:12." },
    { "name": "The One That Speaks But Doesn't Stun: Defeat Raksha, the Shadow Colossus without being stunned by his 'Tail Sweep', 'Trampling Charge' and 'Shadow bomb' attacks." },
    { "name": "The True Iceborn: Defeat the Arch-Glacor at 4,000% enrage." },
    { "name": "The True Warden: Defeat Telos, the Warden at 4,000% enrage." },
    { "name": "The Ultimate Tank Test: Defeat Kerapac, the bound in hard mode without entering an echo's time thread." },
    { "name": "There's Always Something Behind the Waterfall: Defeat Vorago after mitigating all damage from his 'Waterfall' attack in stage 4." },
    { "name": "These Boots Are Made For Kicking...K'ril: Defeat K'ril Tsutsaroth, solo, after using 'Debilitate' to mitigate his 'Prayer Destruction' attack." },
    { "name": "They All Fell Down: Defeat the Dagannoth Kings solo, all within 5 seconds of each other." },
    { "name": "This Is Not True Power: Defeat Rasial, the First Necromancer without being hit by his 'Volley of Souls' attack." },
    { "name": "Through the Fire and Flames: Kill the Queen Black Dragon with a royal crossbow. Can only be completed in a solo instance." },
    { "name": "Too Close for Comfort: Defeat Nex solo, without being moved by her 'Drag' attack during her Smoke phase." },
    { "name": "Too Many Bones to Pick From: Defeat Osseous solo after defeating 6 Baby Dinosaur Skeletons within 9s." },
    { "name": "Too Mushroom II: Defeat Helwyr in hard mode, solo, without being hit by his 'Mushroom Explosion' attack." },
    { "name": "Tornado Warning: Defeat Kree'arra solo, without being moved by his 'Ranged Tornado' and 'Magic Tornado' attacks." },
    { "name": "Tsutsaroth-made Stalagmite: Defeat K'ril Tsutsaroth in hard mode, solo, without being hit by his 'Smash' attack." },
    { "name": "Ultra Instinct: Defeat Raksha without letting him gain any shadow energy. Can only be completed in a solo instance." },
    { "name": "Unleash the Font: Defeat Telos, the Warden at 4000% enrage after charging and using a font in phase 5." },
    { "name": "Unpr-edict-able: Defeat Zamorak, Lord of Chaos at 750% or higher enrage after activating the edicts in order of: 3, 5, 6, 1, 4, 2 (H, V, E2, B, A, E1)." },
    { "name": "Vermyx, Brood Mother (HM) (perfect): Defeat Vermyx, Brood Mother in hard mode while completing the listed achievements." },
    { "name": "Vermyx, Brood Mother (perfect): Defeat Vermyx, Brood Mother without being resurrected while completing the listed achievements." },
    { "name": "Vorago (solo): Defeat Vorago solo." },
    { "name": "Waiting For His Turn: Defeat Telos, the Warden at 1000% or higher enrage without letting him use his basic attack in phase 4." },
    { "name": "Waive that: Defeat the Queen Black Dragon without being hit by her fire wave attack." },
    { "name": "Was That For Me?: Defeat K'ril Tsutsaroth in hard mode, solo, without being hit by his 'Charge' attack." },
    { "name": "Weather Forecast: Defeat Kree'arra in hard mode, solo, without being hit by his 'Vortex' attack." },
    { "name": "Web Protection: Defeat Araxxi after using the correct protection prayer against all of her basic attacks in phase 4." },
    { "name": "Web-breaker: Defeat Araxxor and Araxxi without anyone taking unnecessary damage from their 'Cocoon' attack." },
    { "name": "Wolf Pack: Defeat Helwyr whilst there are 4 Cywir Alphas still alive. Can only be completed in a solo instance." },
    { "name": "You Can't Siphon Me: Defeat Solak, Guardian of the Grove without anyone being hit by his 'Blight Siphon' attack." },
    { "name": "You Wouldn't Like Me When I'm Angry (General Graardor achievement): Defeat General Graardor in hard mode, solo, without taking damage from his 'Graardor Mad' attack." },
    { "name": "Zamehameha: Defeat Zamorak, Lord of Chaos at 1,000% or higher enrage after letting him fully charge his world-ending attack in phase 7." },
    { "name": "Zemouregal & Vorkath (HM) Elite Speed Killer: Defeat Zemouregal & Vorkath in hard mode in less than 05:00." },
    { "name": "Zemouregal & Vorkath (HM) Grandmaster Speed Killer: Defeat Zemouregal & Vorkath in hard mode in less than 01:45." },
    { "name": "Zemouregal & Vorkath (HM) Master Speed Killer: Defeat Zemouregal & Vorkath in hard mode in less than 02:45." },
    { "name": "Zemouregal & Vorkath Competent Speed Killer: Defeat Zemouregal & Vorkath in less than 05:30." },
    { "name": "Zemouregal & Vorkath Elite Speed Killer: Defeat Zemouregal & Vorkath in less than 04:00." }
  ],
  "Custom Achievements": [
    { "name": "Example 1: Description." },
    { "name": "Example 2: Description." }
  ]
}
