{  
  "In-game Achievements": [
    { "name": "A Quest for Understanding: Defeat Astellarn while at least two pulsars are still active." },
    { "name": "A Song of Ice and Ire IV: Defeat the Arch-Glacor at 500% enrage. (X/500)" },
    { "name": "A Song of Ice and Ire VII: Defeat the Arch-Glacor at 2,000% enrage." },
    { "name": "Anti-anima-golem: Defeat Telos, the Warden at 100% or higher enrage without being hit by an anima-golem." },
    { "name": "Araxxi Elite Speed Killer: Defeat Araxxi solo in less than 03:00." },
    { "name": "Araxxi Master Speed Killer: Defeat Araxxi solo in less than 01:42." },
    { "name": "Arch-Glacor (HM) Elite Speed Killer: Defeat the Arch-Glacor in hard mode at 500% or higher enrage in less than 05:00." },
    { "name": "Arch-Glacor (HM) Grandmaster Speed Killer: Defeat the Arch-Glacor in hard mode at 3000% or higher enrage in less than 05:30." },
    { "name": "Arch-Glacor (HM) Master Speed Killer: Defeat the Arch-Glacor in hard mode at 1000% or higher enrage in less than 02:30." },
    { "name": "Are You Winning, Zam? IV: Defeat Zamorak at 500% enrage in a solo encounter." },
    { "name": "Are You Winning, Zam? VI: Defeat Zamorak at 1,000% enrage in a solo encounter." },
    { "name": "Are You Winning, Zam? VII: Defeat Zamorak, Lord of Chaos solo at 2,000% enrage." },
    { "name": "Astellarn Elite Speed Killer: Defeat Astellarn solo in less than 01:00." },
    { "name": "Barrows: Rise of the Six (solo): Defeat Barrows: Rise of the Six solo." },
    { "name": "Beastmaster Durzag (solo): Defeat Beastmaster Durzag solo." },
    { "name": "Beetlejuice Beetlejuice: Defeat the Kalphite King in a team of 4 or fewer without anyone dying to a 'Beetlejuice' attack." },
    { "name": "Blade Dancer: Defeat Gregorovic solo without being hit by his 'Glaives' attack." },
    { "name": "Burrowed Time: Defeat the Kalphite King in a team of 4 or fewer without anyone being hit by any of his 'Burrow' attacks." },
    { "name": "Can't Touch This: Defeat Kerapac, the bound without getting hit by his 'Lightning Strike' attack." },
    { "name": "Canon Event: Defeat Kerapac, the bound in hard mode, solo with at least 3 active time thread tears." },
    { "name": "Classic Dragon Killing: Defeat Vindicta & Gorvek solo whilst having equipped a shield that provides protection against dragonfire." },
    { "name": "Cleaning Up the Shadows: Defeat Raksha, the Shadow Colossus after entering phase 4 with no active shadow pools." },
    { "name": "Cleaving the Way: Defeat Araxxor and Araxxi without anyone being hit by their 'Cleave' attack." },
    { "name": "Cold Spell: Defeat Nex solo, without being hit by her 'Contain' and 'Ice Prison' attacks during her Ice phase." },
    { "name": "Connection lost. Please wait - attempting to reestablish: Defeat Rasial, the First Necromancer without moving for 45s after being hit by his 'Finger of Death' attack in phase 4." },
    { "name": "Core Problem: Defeat the Corporeal Beast without being hit by the Dark Energy Core. Can only be completed in a solo instance." },
    { "name": "Coursing Through You: Defeat Telos, the Warden at 100% or higher enrage after taking the full damage of the virus in phase 5." },
    { "name": "Currently Shockproof: Defeat Pthentraken solo after mitigating her 'Converging Lightning' attack using insulated boots." },
    { "name": "Definitely Can't Touch This: Defeat Kerapac, the bound in hard mode without being hit by his 'Lightning Strike' attack." },
    ----- continue from here alphabetically
    
  ],
  "Custom Achievements": [
    { "name": "Example 1: Description." },
    { "name": "Example 2: Description." }
  ]
}
